Revit 2024 API
CategoryNameMapIterator.Reset Method
Bring the iterator back to the start of the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Reset()
Visual Basic
Public Overridable Sub Reset
Visual C++
public:
virtual void Reset()
Implements
IEnumerator.Reset()
Remarks
The Reset method will return the iterator back to the start of the map in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.
See Also
CategoryNameMapIterator Class
Autodesk.Revit.DB Namespace